app/controllers/api/businesses_controller.rb

SELECT "businesses".* FROM "businesses"
---
	def index
		@businesses = Business.all

INSERT INTO "businesses" ("name", "address", "hours", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		full_params = business_params
		full_params[:user_id] = current_user.id
		@business = Business.new(full_params)
		if @business.save

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@business = Business.find(params[:id])

SELECT "businesses".* FROM "businesses" WHERE (name ~ 'a')
SELECT "businesses".* FROM "businesses"
---
	def search
		if params[:query].present?
			if params[:tag_ids].present?
				tag_ids = params[:tag_ids].map {|tag_id| tag_id.to_i}
				@businesses = Business.joins(:taggings).where("taggings.tag_id IN (?) AND lower(businesses.name) ~ ?", tag_ids, params[:query].downcase)
				puts "query and tags"
			else
				 @businesses = Business.where("lower(name) ~ ?", params[:query].downcase)
				 puts "just query"
			end
			render :index
		else
			if params[:tag_ids].present?
				@businesses = Business.joins(:taggings).where("taggings.tag_id" => params[:tag_ids])
				puts "just tags"
			else
				@businesses = Business.all