app/controllers/api/reviews_controller.rb

INSERT INTO "reviews" ("body", "rating", "business_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "asdfasdfjlaksdfaksdjf"], ["rating", 5], ["business_id", 1], ["user_id", 1], ["created_at", "2016-04-30 17:39:59.680274"], ["updated_at", "2016-04-30 17:39:59.680274"]]
---
	def create
		full_params = review_params
		full_params[:user_id] = current_user.id
		full_params[:stars] = full_params[:stars].to_i
		@review = Review.new(review_params)
		if @review.save